// Problem-01 : Help The Zoo Manager
//Function Name Must be calculateMoney( )
// বাকের ভাই মিরপুর চিড়িয়াখানার ম্যানেজার । প্রতিদিন তাকে অসংখ্য টিকেট বিক্রি করতে হয় । টাকার হিসেব এ তিনি সবসময় গড়মিল বাধিয়ে ফেলেন । তুমি যে হে তুসদ্য ডেভেল োপার হচ্ছ ো বাকের ভাই ত োমার কাছে একটি হেল্প চেয়েছে। বাকের ভাই কে calculateMoney( ) নামে একটি ফাংশন বানিয়ে দিতে হবে যাকে প্রতিদিন টিকেট সেল করার সংখ্যা ইনপুট দিলে সে সকল খরচ বাদ দিয়ে মোট কত টাকা বাকের ভাইর কাছে থাকে তা বলে দিতে পারে। 

//চিড়িয়াখানায় প্রতি টিকেট বিক্রি হয় ১২০ টাকায় । আর ব্যয় এর মধ্যে প্রতিদিন ১ জন দারোয়ান কে দিতে হয় ৫০০ টাকা এবং ৮ জন স্টাফ কে লাঞ্চ করানোর জন্যে খরচ হয় জনপ্রতি ৫০ টাকা করে ।

//Input :
//ফাংশন টি ইনপুট নেবে টিকেট সেল করার সংখ্যা । ইনপুট হবে একটি পজিটিভ সংখ্যা। (0<=Input)

// Output :
// টিকেটের আয় ও ব্যয় গুল ো ক্যালকুলে ট করে বাকী কত টাকা বাকে র ভাইর কাছে থাকল ো সে টা ই ত োমার ফাংশন আউটপুট হিসেবে রিটার্ন করবে । আউটপুট পজিটিভ নেগেটিভ যে ক োন কিছুই হতে পারে ।
//যেমন ইনপুট যদি 10 হয় তাহলে আউটপুট হবে ( 10 * 120) - ( 500 + (8 * 50) ) = 300



function calculateMoney(ticketSale) {
    if (ticketSale < 0) {
        return "Please enter a number.......";
    } else {
        const ticketPrice = 120;
        const guardPayment = 500;
        const staffLaunch = 50 * 8;

        let remain = (ticketSale * ticketPrice) - (guardPayment + staffLaunch);
        return remain;
    }
}
